dbbench/amp_55.org
#+TITLE: amplification 50%read 50%write
#+SETUPFILE: ../latexcss/latexcss.theme

* Term

| Term             | Description                                                           |
|------------------+-----------------------------------------------------------------------|
| FS read          | filesystem read(file->Read(), file->MultiRead())                      |
| FS write         | filesystem write(file->Append(), file->Write())                       |
| Compaction read  | FileSize(input files from levelN)+FileSize(input files from levelN+1) |
| Compaction write | FileSize(output files)                                                |
| User read        | size of value returned by Get()                                       |
| User write       | size of record(key+value) passed into Put()                           |
| WriteBatch size  | size of WriteBatches processed by Write()                             |

* Load

| DB          | FS read(GB) | FS write(GB) | Compaction read(GB) | Compaction write(GB) | Latency avg(us) | pct99(us) | OPS     | Throuput(MB/s) |
|-------------+-------------+--------------+---------------------+----------------------+-----------------+-----------+---------+----------------|
| RocksDB-32  |      174.33 |       233.98 |              159.57 |               180.84 |           38.06 |     32.11 | 207,980 |           6.35 |
| RocksDB-128 |       77.32 |       116.37 |               69.24 |                87.92 |           59.28 |     38.21 | 132,886 |          16.22 |
| RocksDB-256 |       77.37 |       119.22 |               71.73 |                91.41 |           90.73 |     50.43 | 86,746  |          21,18 |
| RocksDB-512 |       74.02 |       115.83 |               68.66 |                88.23 |          158.22 |     73.15 | 49,724  |          24.28 |
| RocksDB-1K  |       74.63 |       115.54 |               66.00 |                85.10 |          283.46 |  14925.82 | 27,681  |          27.03 |


* Run

| DB          | User read (GB) | User write (GB) | WriteBatch size(GB) | FS read(GB) | FS write(GB) | Compaction read(GB) | Compaction write(GB) | Latency avg(us) | pct99(us) | OPS    | Throuput(MB/s) |
|-------------+----------------+-----------------+---------------------+-------------+--------------+---------------------+----------------------+-----------------+-----------+--------+----------------|
| RocksDB-32  |           0.52 |            0.69 |                1.00 |      333.21 |        13.94 |               11.56 |                11.91 |           11.80 |     24.82 | 72,042 |           2.20 |
| RocksDB-128 |           1.50 |            1.60 |                1.78 |      397.83 |        26.13 |               21.24 |                22.30 |           27.36 |     23.50 | 46,515 |           5.68 |
| RocksDB-256 |           2.93 |            3.02 |                3.20 |      384.83 |        33.69 |               25.32 |                28.24 |           31.92 |     25.01 | 43,859 |          10.71 |
| RocksDB-512 |           4.90 |            4.98 |                5.13 |      312.17 |        44.48 |               31.59 |                36.34 |          124.39 |   2672.64 | 32,427 |          15.83 |
| RocksDB-1K  |           6.18 |            6.22 |                6.32 |      213.99 |        50.87 |               35.60 |                41.44 |          341.83 |  13172.44 | 20,271 |          19.80 |












