dbbench/amp_55.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-29 Wed 16:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>amplification 50%read 50%write</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="latexcss/latexcss.css" />
<link rel="stylesheet" type="text/css" href="../latexcss/latexcss.css" />
<link rel="alternate stylesheet" type="https://orgmode.org/resources/style/org-demo.min.css" />
<link rel="alternate stylesheet" type="../latexcss/latexcss.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">amplification 50%read 50%write</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org641a6b6">1. Term</a></li>
<li><a href="#orgd919c51">2. Load</a></li>
<li><a href="#org07ba22f">3. Run</a></li>
</ul>
</div>
</div>

<div id="outline-container-org641a6b6" class="outline-2">
<h2 id="org641a6b6"><span class="section-number-2">1.</span> Term</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">FS read</td>
<td class="org-left">filesystem read(file-&gt;Read(), file-&gt;MultiRead())</td>
</tr>

<tr>
<td class="org-left">FS write</td>
<td class="org-left">filesystem write(file-&gt;Append(), file-&gt;Write())</td>
</tr>

<tr>
<td class="org-left">Compaction read</td>
<td class="org-left">FileSize(input files from levelN)+FileSize(input files from levelN+1)</td>
</tr>

<tr>
<td class="org-left">Compaction write</td>
<td class="org-left">FileSize(output files)</td>
</tr>

<tr>
<td class="org-left">User read</td>
<td class="org-left">size of value returned by Get()</td>
</tr>

<tr>
<td class="org-left">User write</td>
<td class="org-left">size of record(key+value) passed into Put()</td>
</tr>

<tr>
<td class="org-left">WriteBatch size</td>
<td class="org-left">size of WriteBatches processed by Write()</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd919c51" class="outline-2">
<h2 id="orgd919c51"><span class="section-number-2">2.</span> Load</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">FS read(GB)</th>
<th scope="col" class="org-right">FS write(GB)</th>
<th scope="col" class="org-right">Compaction read(GB)</th>
<th scope="col" class="org-right">Compaction write(GB)</th>
<th scope="col" class="org-right">Latency avg(us)</th>
<th scope="col" class="org-right">pct99(us)</th>
<th scope="col" class="org-left">OPS</th>
<th scope="col" class="org-right">Throuput(MB/s)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-32</td>
<td class="org-right">174.33</td>
<td class="org-right">233.98</td>
<td class="org-right">159.57</td>
<td class="org-right">180.84</td>
<td class="org-right">38.06</td>
<td class="org-right">32.11</td>
<td class="org-left">207,980</td>
<td class="org-right">6.35</td>
</tr>

<tr>
<td class="org-left">RocksDB-128</td>
<td class="org-right">77.32</td>
<td class="org-right">116.37</td>
<td class="org-right">69.24</td>
<td class="org-right">87.92</td>
<td class="org-right">59.28</td>
<td class="org-right">38.21</td>
<td class="org-left">132,886</td>
<td class="org-right">16.22</td>
</tr>

<tr>
<td class="org-left">RocksDB-256</td>
<td class="org-right">77.37</td>
<td class="org-right">119.22</td>
<td class="org-right">71.73</td>
<td class="org-right">91.41</td>
<td class="org-right">90.73</td>
<td class="org-right">50.43</td>
<td class="org-left">86,746</td>
<td class="org-right">21,18</td>
</tr>

<tr>
<td class="org-left">RocksDB-512</td>
<td class="org-right">74.02</td>
<td class="org-right">115.83</td>
<td class="org-right">68.66</td>
<td class="org-right">88.23</td>
<td class="org-right">158.22</td>
<td class="org-right">73.15</td>
<td class="org-left">49,724</td>
<td class="org-right">24.28</td>
</tr>

<tr>
<td class="org-left">RocksDB-1K</td>
<td class="org-right">74.63</td>
<td class="org-right">115.54</td>
<td class="org-right">66.00</td>
<td class="org-right">85.10</td>
<td class="org-right">283.46</td>
<td class="org-right">14925.82</td>
<td class="org-left">27,681</td>
<td class="org-right">27.03</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org07ba22f" class="outline-2">
<h2 id="org07ba22f"><span class="section-number-2">3.</span> Run</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">User read (GB)</th>
<th scope="col" class="org-right">User write (GB)</th>
<th scope="col" class="org-right">WriteBatch size(GB)</th>
<th scope="col" class="org-right">FS read(GB)</th>
<th scope="col" class="org-right">FS write(GB)</th>
<th scope="col" class="org-right">Compaction read(GB)</th>
<th scope="col" class="org-right">Compaction write(GB)</th>
<th scope="col" class="org-right">Latency avg(us)</th>
<th scope="col" class="org-right">pct99(us)</th>
<th scope="col" class="org-left">OPS</th>
<th scope="col" class="org-right">Throuput(MB/s)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-32</td>
<td class="org-right">0.52</td>
<td class="org-right">0.69</td>
<td class="org-right">1.00</td>
<td class="org-right">333.21</td>
<td class="org-right">13.94</td>
<td class="org-right">11.56</td>
<td class="org-right">11.91</td>
<td class="org-right">11.80</td>
<td class="org-right">24.82</td>
<td class="org-left">72,042</td>
<td class="org-right">2.20</td>
</tr>

<tr>
<td class="org-left">RocksDB-128</td>
<td class="org-right">1.50</td>
<td class="org-right">1.60</td>
<td class="org-right">1.78</td>
<td class="org-right">397.83</td>
<td class="org-right">26.13</td>
<td class="org-right">21.24</td>
<td class="org-right">22.30</td>
<td class="org-right">27.36</td>
<td class="org-right">23.50</td>
<td class="org-left">46,515</td>
<td class="org-right">5.68</td>
</tr>

<tr>
<td class="org-left">RocksDB-256</td>
<td class="org-right">2.93</td>
<td class="org-right">3.02</td>
<td class="org-right">3.20</td>
<td class="org-right">384.83</td>
<td class="org-right">33.69</td>
<td class="org-right">25.32</td>
<td class="org-right">28.24</td>
<td class="org-right">31.92</td>
<td class="org-right">25.01</td>
<td class="org-left">43,859</td>
<td class="org-right">10.71</td>
</tr>

<tr>
<td class="org-left">RocksDB-512</td>
<td class="org-right">4.90</td>
<td class="org-right">4.98</td>
<td class="org-right">5.13</td>
<td class="org-right">312.17</td>
<td class="org-right">44.48</td>
<td class="org-right">31.59</td>
<td class="org-right">36.34</td>
<td class="org-right">124.39</td>
<td class="org-right">2672.64</td>
<td class="org-left">32,427</td>
<td class="org-right">15.83</td>
</tr>

<tr>
<td class="org-left">RocksDB-1K</td>
<td class="org-right">6.18</td>
<td class="org-right">6.22</td>
<td class="org-right">6.32</td>
<td class="org-right">213.99</td>
<td class="org-right">50.87</td>
<td class="org-right">35.60</td>
<td class="org-right">41.44</td>
<td class="org-right">341.83</td>
<td class="org-right">13172.44</td>
<td class="org-left">20,271</td>
<td class="org-right">19.80</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2023-03-29 Wed 16:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
